GopalSaraf/Practicals/PSDL/include/proc/pic18f97j94.inc
// Register: LCDDATA13
#define LCDDATA13 LCDDATA13
LCDDATA13                                equ 0E9Bh
// bitfield definitions
LCDDATA13_S40C1_POSN                     equ 0000h
LCDDATA13_S40C1_POSITION                 equ 0000h
LCDDATA13_S40C1_SIZE                     equ 0001h
LCDDATA13_S40C1_LENGTH                   equ 0001h
LCDDATA13_S40C1_MASK                     equ 0001h
LCDDATA13_S41C1_POSN                     equ 0001h
LCDDATA13_S41C1_POSITION                 equ 0001h
LCDDATA13_S41C1_SIZE                     equ 0001h
LCDDATA13_S41C1_LENGTH                   equ 0001h
LCDDATA13_S41C1_MASK                     equ 0002h
LCDDATA13_S42C1_POSN                     equ 0002h
LCDDATA13_S42C1_POSITION                 equ 0002h
LCDDATA13_S42C1_SIZE                     equ 0001h
LCDDATA13_S42C1_LENGTH                   equ 0001h
LCDDATA13_S42C1_MASK                     equ 0004h
LCDDATA13_S43C1_POSN                     equ 0003h
LCDDATA13_S43C1_POSITION                 equ 0003h
LCDDATA13_S43C1_SIZE                     equ 0001h
LCDDATA13_S43C1_LENGTH                   equ 0001h
LCDDATA13_S43C1_MASK                     equ 0008h
LCDDATA13_S44C1_POSN                     equ 0004h
LCDDATA13_S44C1_POSITION                 equ 0004h
LCDDATA13_S44C1_SIZE                     equ 0001h
LCDDATA13_S44C1_LENGTH                   equ 0001h
LCDDATA13_S44C1_MASK                     equ 0010h
LCDDATA13_S45C1_POSN                     equ 0005h
LCDDATA13_S45C1_POSITION                 equ 0005h
LCDDATA13_S45C1_SIZE                     equ 0001h
LCDDATA13_S45C1_LENGTH                   equ 0001h
LCDDATA13_S45C1_MASK                     equ 0020h
LCDDATA13_S46C1_POSN                     equ 0006h
LCDDATA13_S46C1_POSITION                 equ 0006h
LCDDATA13_S46C1_SIZE                     equ 0001h
LCDDATA13_S46C1_LENGTH                   equ 0001h
LCDDATA13_S46C1_MASK                     equ 0040h
LCDDATA13_S47C1_POSN                     equ 0007h
LCDDATA13_S47C1_POSITION                 equ 0007h
LCDDATA13_S47C1_SIZE                     equ 0001h
LCDDATA13_S47C1_LENGTH                   equ 0001h
LCDDATA13_S47C1_MASK                     equ 0080h

// Register: LCDDATA14
#define LCDDATA14 LCDDATA14
LCDDATA14                                equ 0E9Ch
// bitfield definitions
LCDDATA14_S48C1_POSN                     equ 0000h
LCDDATA14_S48C1_POSITION                 equ 0000h
LCDDATA14_S48C1_SIZE                     equ 0001h
LCDDATA14_S48C1_LENGTH                   equ 0001h
LCDDATA14_S48C1_MASK                     equ 0001h
LCDDATA14_S49C1_POSN                     equ 0001h
LCDDATA14_S49C1_POSITION                 equ 0001h
LCDDATA14_S49C1_SIZE                     equ 0001h
LCDDATA14_S49C1_LENGTH                   equ 0001h
LCDDATA14_S49C1_MASK                     equ 0002h
LCDDATA14_S50C1_POSN                     equ 0002h
LCDDATA14_S50C1_POSITION                 equ 0002h
LCDDATA14_S50C1_SIZE                     equ 0001h
LCDDATA14_S50C1_LENGTH                   equ 0001h
LCDDATA14_S50C1_MASK                     equ 0004h
LCDDATA14_S51C1_POSN                     equ 0003h
LCDDATA14_S51C1_POSITION                 equ 0003h
LCDDATA14_S51C1_SIZE                     equ 0001h
LCDDATA14_S51C1_LENGTH                   equ 0001h
LCDDATA14_S51C1_MASK                     equ 0008h
LCDDATA14_S52C1_POSN                     equ 0004h
LCDDATA14_S52C1_POSITION                 equ 0004h
LCDDATA14_S52C1_SIZE                     equ 0001h
LCDDATA14_S52C1_LENGTH                   equ 0001h
LCDDATA14_S52C1_MASK                     equ 0010h
LCDDATA14_S53C1_POSN                     equ 0005h
LCDDATA14_S53C1_POSITION                 equ 0005h
LCDDATA14_S53C1_SIZE                     equ 0001h
LCDDATA14_S53C1_LENGTH                   equ 0001h
LCDDATA14_S53C1_MASK                     equ 0020h
LCDDATA14_S54C1_POSN                     equ 0006h
LCDDATA14_S54C1_POSITION                 equ 0006h
LCDDATA14_S54C1_SIZE                     equ 0001h
LCDDATA14_S54C1_LENGTH                   equ 0001h
LCDDATA14_S54C1_MASK                     equ 0040h
LCDDATA14_S55C1_POSN                     equ 0007h
LCDDATA14_S55C1_POSITION                 equ 0007h
LCDDATA14_S55C1_SIZE                     equ 0001h
LCDDATA14_S55C1_LENGTH                   equ 0001h
LCDDATA14_S55C1_MASK                     equ 0080h
LCDDATA14_MSK0_POSN                      equ 0000h
LCDDATA14_MSK0_POSITION                  equ 0000h
LCDDATA14_MSK0_SIZE                      equ 0001h
LCDDATA14_MSK0_LENGTH                    equ 0001h
LCDDATA14_MSK0_MASK                      equ 0001h
LCDDATA14_MSK1_POSN                      equ 0001h
LCDDATA14_MSK1_POSITION                  equ 0001h
LCDDATA14_MSK1_SIZE                      equ 0001h
LCDDATA14_MSK1_LENGTH                    equ 0001h
LCDDATA14_MSK1_MASK                      equ 0002h
LCDDATA14_MSK2_POSN                      equ 0002h
LCDDATA14_MSK2_POSITION                  equ 0002h
LCDDATA14_MSK2_SIZE                      equ 0001h
LCDDATA14_MSK2_LENGTH                    equ 0001h
LCDDATA14_MSK2_MASK                      equ 0004h
LCDDATA14_MSK3_POSN                      equ 0003h
LCDDATA14_MSK3_POSITION                  equ 0003h
LCDDATA14_MSK3_SIZE                      equ 0001h
LCDDATA14_MSK3_LENGTH                    equ 0001h
LCDDATA14_MSK3_MASK                      equ 0008h
LCDDATA14_MSK4_POSN                      equ 0004h
LCDDATA14_MSK4_POSITION                  equ 0004h
LCDDATA14_MSK4_SIZE                      equ 0001h
LCDDATA14_MSK4_LENGTH                    equ 0001h
LCDDATA14_MSK4_MASK                      equ 0010h
LCDDATA14_MSK5_POSN                      equ 0005h
LCDDATA14_MSK5_POSITION                  equ 0005h
LCDDATA14_MSK5_SIZE                      equ 0001h
LCDDATA14_MSK5_LENGTH                    equ 0001h
LCDDATA14_MSK5_MASK                      equ 0020h
LCDDATA14_MSK6_POSN                      equ 0006h
LCDDATA14_MSK6_POSITION                  equ 0006h
LCDDATA14_MSK6_SIZE                      equ 0001h
LCDDATA14_MSK6_LENGTH                    equ 0001h
LCDDATA14_MSK6_MASK                      equ 0040h
LCDDATA14_MSK7_POSN                      equ 0007h
LCDDATA14_MSK7_POSITION                  equ 0007h
LCDDATA14_MSK7_SIZE                      equ 0001h
LCDDATA14_MSK7_LENGTH                    equ 0001h
LCDDATA14_MSK7_MASK                      equ 0080h

