GopalSaraf/Practicals/PSDL/include/proc/pic18f97j94.inc
// Register: LCDDATA34
#define LCDDATA34 LCDDATA34
LCDDATA34                                equ 0EB0h
// bitfield definitions
LCDDATA34_S16C4_POSN                     equ 0000h
LCDDATA34_S16C4_POSITION                 equ 0000h
LCDDATA34_S16C4_SIZE                     equ 0001h
LCDDATA34_S16C4_LENGTH                   equ 0001h
LCDDATA34_S16C4_MASK                     equ 0001h
LCDDATA34_S17C4_POSN                     equ 0001h
LCDDATA34_S17C4_POSITION                 equ 0001h
LCDDATA34_S17C4_SIZE                     equ 0001h
LCDDATA34_S17C4_LENGTH                   equ 0001h
LCDDATA34_S17C4_MASK                     equ 0002h
LCDDATA34_S18C4_POSN                     equ 0002h
LCDDATA34_S18C4_POSITION                 equ 0002h
LCDDATA34_S18C4_SIZE                     equ 0001h
LCDDATA34_S18C4_LENGTH                   equ 0001h
LCDDATA34_S18C4_MASK                     equ 0004h
LCDDATA34_S19C4_POSN                     equ 0003h
LCDDATA34_S19C4_POSITION                 equ 0003h
LCDDATA34_S19C4_SIZE                     equ 0001h
LCDDATA34_S19C4_LENGTH                   equ 0001h
LCDDATA34_S19C4_MASK                     equ 0008h
LCDDATA34_S20C4_POSN                     equ 0004h
LCDDATA34_S20C4_POSITION                 equ 0004h
LCDDATA34_S20C4_SIZE                     equ 0001h
LCDDATA34_S20C4_LENGTH                   equ 0001h
LCDDATA34_S20C4_MASK                     equ 0010h
LCDDATA34_S21C4_POSN                     equ 0005h
LCDDATA34_S21C4_POSITION                 equ 0005h
LCDDATA34_S21C4_SIZE                     equ 0001h
LCDDATA34_S21C4_LENGTH                   equ 0001h
LCDDATA34_S21C4_MASK                     equ 0020h
LCDDATA34_S22C4_POSN                     equ 0006h
LCDDATA34_S22C4_POSITION                 equ 0006h
LCDDATA34_S22C4_SIZE                     equ 0001h
LCDDATA34_S22C4_LENGTH                   equ 0001h
LCDDATA34_S22C4_MASK                     equ 0040h
LCDDATA34_S23C4_POSN                     equ 0007h
LCDDATA34_S23C4_POSITION                 equ 0007h
LCDDATA34_S23C4_SIZE                     equ 0001h
LCDDATA34_S23C4_LENGTH                   equ 0001h
LCDDATA34_S23C4_MASK                     equ 0080h

// Register: LCDDATA35
#define LCDDATA35 LCDDATA35
LCDDATA35                                equ 0EB1h
// bitfield definitions
LCDDATA35_S24C4_POSN                     equ 0000h
LCDDATA35_S24C4_POSITION                 equ 0000h
LCDDATA35_S24C4_SIZE                     equ 0001h
LCDDATA35_S24C4_LENGTH                   equ 0001h
LCDDATA35_S24C4_MASK                     equ 0001h
LCDDATA35_S25C4_POSN                     equ 0001h
LCDDATA35_S25C4_POSITION                 equ 0001h
LCDDATA35_S25C4_SIZE                     equ 0001h
LCDDATA35_S25C4_LENGTH                   equ 0001h
LCDDATA35_S25C4_MASK                     equ 0002h
LCDDATA35_S26C4_POSN                     equ 0002h
LCDDATA35_S26C4_POSITION                 equ 0002h
LCDDATA35_S26C4_SIZE                     equ 0001h
LCDDATA35_S26C4_LENGTH                   equ 0001h
LCDDATA35_S26C4_MASK                     equ 0004h
LCDDATA35_S27C4_POSN                     equ 0003h
LCDDATA35_S27C4_POSITION                 equ 0003h
LCDDATA35_S27C4_SIZE                     equ 0001h
LCDDATA35_S27C4_LENGTH                   equ 0001h
LCDDATA35_S27C4_MASK                     equ 0008h
LCDDATA35_S28C4_POSN                     equ 0004h
LCDDATA35_S28C4_POSITION                 equ 0004h
LCDDATA35_S28C4_SIZE                     equ 0001h
LCDDATA35_S28C4_LENGTH                   equ 0001h
LCDDATA35_S28C4_MASK                     equ 0010h
LCDDATA35_S29C4_POSN                     equ 0005h
LCDDATA35_S29C4_POSITION                 equ 0005h
LCDDATA35_S29C4_SIZE                     equ 0001h
LCDDATA35_S29C4_LENGTH                   equ 0001h
LCDDATA35_S29C4_MASK                     equ 0020h
LCDDATA35_S30C4_POSN                     equ 0006h
LCDDATA35_S30C4_POSITION                 equ 0006h
LCDDATA35_S30C4_SIZE                     equ 0001h
LCDDATA35_S30C4_LENGTH                   equ 0001h
LCDDATA35_S30C4_MASK                     equ 0040h
LCDDATA35_S31C4_POSN                     equ 0007h
LCDDATA35_S31C4_POSITION                 equ 0007h
LCDDATA35_S31C4_SIZE                     equ 0001h
LCDDATA35_S31C4_LENGTH                   equ 0001h
LCDDATA35_S31C4_MASK                     equ 0080h

// Register: LCDDATA36
#define LCDDATA36 LCDDATA36
LCDDATA36                                equ 0EB2h
// bitfield definitions
LCDDATA36_S32C4_POSN                     equ 0000h
LCDDATA36_S32C4_POSITION                 equ 0000h
LCDDATA36_S32C4_SIZE                     equ 0001h
LCDDATA36_S32C4_LENGTH                   equ 0001h
LCDDATA36_S32C4_MASK                     equ 0001h
LCDDATA36_S33C4_POSN                     equ 0001h
LCDDATA36_S33C4_POSITION                 equ 0001h
LCDDATA36_S33C4_SIZE                     equ 0001h
LCDDATA36_S33C4_LENGTH                   equ 0001h
LCDDATA36_S33C4_MASK                     equ 0002h
LCDDATA36_S34C4_POSN                     equ 0002h
LCDDATA36_S34C4_POSITION                 equ 0002h
LCDDATA36_S34C4_SIZE                     equ 0001h
LCDDATA36_S34C4_LENGTH                   equ 0001h
LCDDATA36_S34C4_MASK                     equ 0004h
LCDDATA36_S35C4_POSN                     equ 0003h
LCDDATA36_S35C4_POSITION                 equ 0003h
LCDDATA36_S35C4_SIZE                     equ 0001h
LCDDATA36_S35C4_LENGTH                   equ 0001h
LCDDATA36_S35C4_MASK                     equ 0008h
LCDDATA36_S36C4_POSN                     equ 0004h
LCDDATA36_S36C4_POSITION                 equ 0004h
LCDDATA36_S36C4_SIZE                     equ 0001h
LCDDATA36_S36C4_LENGTH                   equ 0001h
LCDDATA36_S36C4_MASK                     equ 0010h
LCDDATA36_S37C4_POSN                     equ 0005h
LCDDATA36_S37C4_POSITION                 equ 0005h
LCDDATA36_S37C4_SIZE                     equ 0001h
LCDDATA36_S37C4_LENGTH                   equ 0001h
LCDDATA36_S37C4_MASK                     equ 0020h
LCDDATA36_S38C4_POSN                     equ 0006h
LCDDATA36_S38C4_POSITION                 equ 0006h
LCDDATA36_S38C4_SIZE                     equ 0001h
LCDDATA36_S38C4_LENGTH                   equ 0001h
LCDDATA36_S38C4_MASK                     equ 0040h
LCDDATA36_S39C4_POSN                     equ 0007h
LCDDATA36_S39C4_POSITION                 equ 0007h
LCDDATA36_S39C4_SIZE                     equ 0001h
LCDDATA36_S39C4_LENGTH                   equ 0001h
LCDDATA36_S39C4_MASK                     equ 0080h

// Register: LCDDATA37
#define LCDDATA37 LCDDATA37
LCDDATA37                                equ 0EB3h
// bitfield definitions
LCDDATA37_S40C4_POSN                     equ 0000h
LCDDATA37_S40C4_POSITION                 equ 0000h
LCDDATA37_S40C4_SIZE                     equ 0001h
LCDDATA37_S40C4_LENGTH                   equ 0001h
LCDDATA37_S40C4_MASK                     equ 0001h
LCDDATA37_S41C4_POSN                     equ 0001h
LCDDATA37_S41C4_POSITION                 equ 0001h
LCDDATA37_S41C4_SIZE                     equ 0001h
LCDDATA37_S41C4_LENGTH                   equ 0001h
LCDDATA37_S41C4_MASK                     equ 0002h
LCDDATA37_S42C4_POSN                     equ 0002h
LCDDATA37_S42C4_POSITION                 equ 0002h
LCDDATA37_S42C4_SIZE                     equ 0001h
LCDDATA37_S42C4_LENGTH                   equ 0001h
LCDDATA37_S42C4_MASK                     equ 0004h
LCDDATA37_S43C4_POSN                     equ 0003h
LCDDATA37_S43C4_POSITION                 equ 0003h
LCDDATA37_S43C4_SIZE                     equ 0001h
LCDDATA37_S43C4_LENGTH                   equ 0001h
LCDDATA37_S43C4_MASK                     equ 0008h
LCDDATA37_S44C4_POSN                     equ 0004h
LCDDATA37_S44C4_POSITION                 equ 0004h
LCDDATA37_S44C4_SIZE                     equ 0001h
LCDDATA37_S44C4_LENGTH                   equ 0001h
LCDDATA37_S44C4_MASK                     equ 0010h
LCDDATA37_S45C4_POSN                     equ 0005h
LCDDATA37_S45C4_POSITION                 equ 0005h
LCDDATA37_S45C4_SIZE                     equ 0001h
LCDDATA37_S45C4_LENGTH                   equ 0001h
LCDDATA37_S45C4_MASK                     equ 0020h
LCDDATA37_S46C4_POSN                     equ 0006h
LCDDATA37_S46C4_POSITION                 equ 0006h
LCDDATA37_S46C4_SIZE                     equ 0001h
LCDDATA37_S46C4_LENGTH                   equ 0001h
LCDDATA37_S46C4_MASK                     equ 0040h
LCDDATA37_S47C4_POSN                     equ 0007h
LCDDATA37_S47C4_POSITION                 equ 0007h
LCDDATA37_S47C4_SIZE                     equ 0001h
LCDDATA37_S47C4_LENGTH                   equ 0001h
LCDDATA37_S47C4_MASK                     equ 0080h

// Register: LCDDATA38
#define LCDDATA38 LCDDATA38
LCDDATA38                                equ 0EB4h
// bitfield definitions
LCDDATA38_S48C4_POSN                     equ 0000h
LCDDATA38_S48C4_POSITION                 equ 0000h
LCDDATA38_S48C4_SIZE                     equ 0001h
LCDDATA38_S48C4_LENGTH                   equ 0001h
LCDDATA38_S48C4_MASK                     equ 0001h
LCDDATA38_S49C4_POSN                     equ 0001h
LCDDATA38_S49C4_POSITION                 equ 0001h
LCDDATA38_S49C4_SIZE                     equ 0001h
LCDDATA38_S49C4_LENGTH                   equ 0001h
LCDDATA38_S49C4_MASK                     equ 0002h
LCDDATA38_S50C4_POSN                     equ 0002h
LCDDATA38_S50C4_POSITION                 equ 0002h
LCDDATA38_S50C4_SIZE                     equ 0001h
LCDDATA38_S50C4_LENGTH                   equ 0001h
LCDDATA38_S50C4_MASK                     equ 0004h
LCDDATA38_S51C4_POSN                     equ 0003h
LCDDATA38_S51C4_POSITION                 equ 0003h
LCDDATA38_S51C4_SIZE                     equ 0001h
LCDDATA38_S51C4_LENGTH                   equ 0001h
LCDDATA38_S51C4_MASK                     equ 0008h
LCDDATA38_S52C4_POSN                     equ 0004h
LCDDATA38_S52C4_POSITION                 equ 0004h
LCDDATA38_S52C4_SIZE                     equ 0001h
LCDDATA38_S52C4_LENGTH                   equ 0001h
LCDDATA38_S52C4_MASK                     equ 0010h
LCDDATA38_S53C4_POSN                     equ 0005h
LCDDATA38_S53C4_POSITION                 equ 0005h
LCDDATA38_S53C4_SIZE                     equ 0001h
LCDDATA38_S53C4_LENGTH                   equ 0001h
LCDDATA38_S53C4_MASK                     equ 0020h
LCDDATA38_S54C4_POSN                     equ 0006h
LCDDATA38_S54C4_POSITION                 equ 0006h
LCDDATA38_S54C4_SIZE                     equ 0001h
LCDDATA38_S54C4_LENGTH                   equ 0001h
LCDDATA38_S54C4_MASK                     equ 0040h
LCDDATA38_S55C4_POSN                     equ 0007h
LCDDATA38_S55C4_POSITION                 equ 0007h
LCDDATA38_S55C4_SIZE                     equ 0001h
LCDDATA38_S55C4_LENGTH                   equ 0001h
LCDDATA38_S55C4_MASK                     equ 0080h

// Register: LCDDATA39
#define LCDDATA39 LCDDATA39
LCDDATA39                                equ 0EB5h
// bitfield definitions
LCDDATA39_S56C4_POSN                     equ 0000h
LCDDATA39_S56C4_POSITION                 equ 0000h
LCDDATA39_S56C4_SIZE                     equ 0001h
LCDDATA39_S56C4_LENGTH                   equ 0001h
LCDDATA39_S56C4_MASK                     equ 0001h
LCDDATA39_S57C4_POSN                     equ 0001h
LCDDATA39_S57C4_POSITION                 equ 0001h
LCDDATA39_S57C4_SIZE                     equ 0001h
LCDDATA39_S57C4_LENGTH                   equ 0001h
LCDDATA39_S57C4_MASK                     equ 0002h
LCDDATA39_S58C4_POSN                     equ 0002h
LCDDATA39_S58C4_POSITION                 equ 0002h
LCDDATA39_S58C4_SIZE                     equ 0001h
LCDDATA39_S58C4_LENGTH                   equ 0001h
LCDDATA39_S58C4_MASK                     equ 0004h
LCDDATA39_S59C4_POSN                     equ 0003h
LCDDATA39_S59C4_POSITION                 equ 0003h
LCDDATA39_S59C4_SIZE                     equ 0001h
LCDDATA39_S59C4_LENGTH                   equ 0001h
LCDDATA39_S59C4_MASK                     equ 0008h
LCDDATA39_S60C4_POSN                     equ 0004h
LCDDATA39_S60C4_POSITION                 equ 0004h
LCDDATA39_S60C4_SIZE                     equ 0001h
LCDDATA39_S60C4_LENGTH                   equ 0001h
LCDDATA39_S60C4_MASK                     equ 0010h
LCDDATA39_S61C4_POSN                     equ 0005h
LCDDATA39_S61C4_POSITION                 equ 0005h
LCDDATA39_S61C4_SIZE                     equ 0001h
LCDDATA39_S61C4_LENGTH                   equ 0001h
LCDDATA39_S61C4_MASK                     equ 0020h
LCDDATA39_S62C4_POSN                     equ 0006h
LCDDATA39_S62C4_POSITION                 equ 0006h
LCDDATA39_S62C4_SIZE                     equ 0001h
LCDDATA39_S62C4_LENGTH                   equ 0001h
LCDDATA39_S62C4_MASK                     equ 0040h
LCDDATA39_S63C4_POSN                     equ 0007h
LCDDATA39_S63C4_POSITION                 equ 0007h
LCDDATA39_S63C4_SIZE                     equ 0001h
LCDDATA39_S63C4_LENGTH                   equ 0001h
LCDDATA39_S63C4_MASK                     equ 0080h

// Register: LCDDATA40
#define LCDDATA40 LCDDATA40
LCDDATA40                                equ 0EB6h
// bitfield definitions
LCDDATA40_S00C5_POSN                     equ 0000h
LCDDATA40_S00C5_POSITION                 equ 0000h
LCDDATA40_S00C5_SIZE                     equ 0001h
LCDDATA40_S00C5_LENGTH                   equ 0001h
LCDDATA40_S00C5_MASK                     equ 0001h
LCDDATA40_S01C5_POSN                     equ 0001h
LCDDATA40_S01C5_POSITION                 equ 0001h
LCDDATA40_S01C5_SIZE                     equ 0001h
LCDDATA40_S01C5_LENGTH                   equ 0001h
LCDDATA40_S01C5_MASK                     equ 0002h
LCDDATA40_S02C5_POSN                     equ 0002h
LCDDATA40_S02C5_POSITION                 equ 0002h
LCDDATA40_S02C5_SIZE                     equ 0001h
LCDDATA40_S02C5_LENGTH                   equ 0001h
LCDDATA40_S02C5_MASK                     equ 0004h
LCDDATA40_S03C5_POSN                     equ 0003h
LCDDATA40_S03C5_POSITION                 equ 0003h
LCDDATA40_S03C5_SIZE                     equ 0001h
LCDDATA40_S03C5_LENGTH                   equ 0001h
LCDDATA40_S03C5_MASK                     equ 0008h
LCDDATA40_S04C5_POSN                     equ 0004h
LCDDATA40_S04C5_POSITION                 equ 0004h
LCDDATA40_S04C5_SIZE                     equ 0001h
LCDDATA40_S04C5_LENGTH                   equ 0001h
LCDDATA40_S04C5_MASK                     equ 0010h
LCDDATA40_S05C5_POSN                     equ 0005h
LCDDATA40_S05C5_POSITION                 equ 0005h
LCDDATA40_S05C5_SIZE                     equ 0001h
LCDDATA40_S05C5_LENGTH                   equ 0001h
LCDDATA40_S05C5_MASK                     equ 0020h
LCDDATA40_S06C5_POSN                     equ 0006h
LCDDATA40_S06C5_POSITION                 equ 0006h
LCDDATA40_S06C5_SIZE                     equ 0001h
LCDDATA40_S06C5_LENGTH                   equ 0001h
LCDDATA40_S06C5_MASK                     equ 0040h
LCDDATA40_S07C5_POSN                     equ 0007h
LCDDATA40_S07C5_POSITION                 equ 0007h
LCDDATA40_S07C5_SIZE                     equ 0001h
LCDDATA40_S07C5_LENGTH                   equ 0001h
LCDDATA40_S07C5_MASK                     equ 0080h

