GopalSaraf/Practicals/PSDL/include/proc/pic18f97j94.inc
// Register: TRISD
#define TRISD TRISD
TRISD                                    equ 0F95h
// bitfield definitions
TRISD_TRISD0_POSN                        equ 0000h
TRISD_TRISD0_POSITION                    equ 0000h
TRISD_TRISD0_SIZE                        equ 0001h
TRISD_TRISD0_LENGTH                      equ 0001h
TRISD_TRISD0_MASK                        equ 0001h
TRISD_TRISD1_POSN                        equ 0001h
TRISD_TRISD1_POSITION                    equ 0001h
TRISD_TRISD1_SIZE                        equ 0001h
TRISD_TRISD1_LENGTH                      equ 0001h
TRISD_TRISD1_MASK                        equ 0002h
TRISD_TRISD2_POSN                        equ 0002h
TRISD_TRISD2_POSITION                    equ 0002h
TRISD_TRISD2_SIZE                        equ 0001h
TRISD_TRISD2_LENGTH                      equ 0001h
TRISD_TRISD2_MASK                        equ 0004h
TRISD_TRISD3_POSN                        equ 0003h
TRISD_TRISD3_POSITION                    equ 0003h
TRISD_TRISD3_SIZE                        equ 0001h
TRISD_TRISD3_LENGTH                      equ 0001h
TRISD_TRISD3_MASK                        equ 0008h
TRISD_TRISD4_POSN                        equ 0004h
TRISD_TRISD4_POSITION                    equ 0004h
TRISD_TRISD4_SIZE                        equ 0001h
TRISD_TRISD4_LENGTH                      equ 0001h
TRISD_TRISD4_MASK                        equ 0010h
TRISD_TRISD5_POSN                        equ 0005h
TRISD_TRISD5_POSITION                    equ 0005h
TRISD_TRISD5_SIZE                        equ 0001h
TRISD_TRISD5_LENGTH                      equ 0001h
TRISD_TRISD5_MASK                        equ 0020h
TRISD_TRISD6_POSN                        equ 0006h
TRISD_TRISD6_POSITION                    equ 0006h
TRISD_TRISD6_SIZE                        equ 0001h
TRISD_TRISD6_LENGTH                      equ 0001h
TRISD_TRISD6_MASK                        equ 0040h
TRISD_TRISD7_POSN                        equ 0007h
TRISD_TRISD7_POSITION                    equ 0007h
TRISD_TRISD7_SIZE                        equ 0001h
TRISD_TRISD7_LENGTH                      equ 0001h
TRISD_TRISD7_MASK                        equ 0080h

// Register: TRISE
#define TRISE TRISE
TRISE                                    equ 0F96h
// bitfield definitions
TRISE_TRISE0_POSN                        equ 0000h
TRISE_TRISE0_POSITION                    equ 0000h
TRISE_TRISE0_SIZE                        equ 0001h
TRISE_TRISE0_LENGTH                      equ 0001h
TRISE_TRISE0_MASK                        equ 0001h
TRISE_TRISE1_POSN                        equ 0001h
TRISE_TRISE1_POSITION                    equ 0001h
TRISE_TRISE1_SIZE                        equ 0001h
TRISE_TRISE1_LENGTH                      equ 0001h
TRISE_TRISE1_MASK                        equ 0002h
TRISE_TRISE2_POSN                        equ 0002h
TRISE_TRISE2_POSITION                    equ 0002h
TRISE_TRISE2_SIZE                        equ 0001h
TRISE_TRISE2_LENGTH                      equ 0001h
TRISE_TRISE2_MASK                        equ 0004h
TRISE_TRISE3_POSN                        equ 0003h
TRISE_TRISE3_POSITION                    equ 0003h
TRISE_TRISE3_SIZE                        equ 0001h
TRISE_TRISE3_LENGTH                      equ 0001h
TRISE_TRISE3_MASK                        equ 0008h
TRISE_TRISE4_POSN                        equ 0004h
TRISE_TRISE4_POSITION                    equ 0004h
TRISE_TRISE4_SIZE                        equ 0001h
TRISE_TRISE4_LENGTH                      equ 0001h
TRISE_TRISE4_MASK                        equ 0010h
TRISE_TRISE5_POSN                        equ 0005h
TRISE_TRISE5_POSITION                    equ 0005h
TRISE_TRISE5_SIZE                        equ 0001h
TRISE_TRISE5_LENGTH                      equ 0001h
TRISE_TRISE5_MASK                        equ 0020h
TRISE_TRISE6_POSN                        equ 0006h
TRISE_TRISE6_POSITION                    equ 0006h
TRISE_TRISE6_SIZE                        equ 0001h
TRISE_TRISE6_LENGTH                      equ 0001h
TRISE_TRISE6_MASK                        equ 0040h
TRISE_TRISE7_POSN                        equ 0007h
TRISE_TRISE7_POSITION                    equ 0007h
TRISE_TRISE7_SIZE                        equ 0001h
TRISE_TRISE7_LENGTH                      equ 0001h
TRISE_TRISE7_MASK                        equ 0080h

// Register: TRISF
#define TRISF TRISF
TRISF                                    equ 0F97h
// bitfield definitions
TRISF_TRISF2_POSN                        equ 0002h
TRISF_TRISF2_POSITION                    equ 0002h
TRISF_TRISF2_SIZE                        equ 0001h
TRISF_TRISF2_LENGTH                      equ 0001h
TRISF_TRISF2_MASK                        equ 0004h
TRISF_TRISF3_POSN                        equ 0003h
TRISF_TRISF3_POSITION                    equ 0003h
TRISF_TRISF3_SIZE                        equ 0001h
TRISF_TRISF3_LENGTH                      equ 0001h
TRISF_TRISF3_MASK                        equ 0008h
TRISF_TRISF4_POSN                        equ 0004h
TRISF_TRISF4_POSITION                    equ 0004h
TRISF_TRISF4_SIZE                        equ 0001h
TRISF_TRISF4_LENGTH                      equ 0001h
TRISF_TRISF4_MASK                        equ 0010h
TRISF_TRISF5_POSN                        equ 0005h
TRISF_TRISF5_POSITION                    equ 0005h
TRISF_TRISF5_SIZE                        equ 0001h
TRISF_TRISF5_LENGTH                      equ 0001h
TRISF_TRISF5_MASK                        equ 0020h
TRISF_TRISF6_POSN                        equ 0006h
TRISF_TRISF6_POSITION                    equ 0006h
TRISF_TRISF6_SIZE                        equ 0001h
TRISF_TRISF6_LENGTH                      equ 0001h
TRISF_TRISF6_MASK                        equ 0040h
TRISF_TRISF7_POSN                        equ 0007h
TRISF_TRISF7_POSITION                    equ 0007h
TRISF_TRISF7_SIZE                        equ 0001h
TRISF_TRISF7_LENGTH                      equ 0001h
TRISF_TRISF7_MASK                        equ 0080h

// Register: TRISG
#define TRISG TRISG
TRISG                                    equ 0F98h
// bitfield definitions
TRISG_TRISG0_POSN                        equ 0000h
TRISG_TRISG0_POSITION                    equ 0000h
TRISG_TRISG0_SIZE                        equ 0001h
TRISG_TRISG0_LENGTH                      equ 0001h
TRISG_TRISG0_MASK                        equ 0001h
TRISG_TRISG1_POSN                        equ 0001h
TRISG_TRISG1_POSITION                    equ 0001h
TRISG_TRISG1_SIZE                        equ 0001h
TRISG_TRISG1_LENGTH                      equ 0001h
TRISG_TRISG1_MASK                        equ 0002h
TRISG_TRISG2_POSN                        equ 0002h
TRISG_TRISG2_POSITION                    equ 0002h
TRISG_TRISG2_SIZE                        equ 0001h
TRISG_TRISG2_LENGTH                      equ 0001h
TRISG_TRISG2_MASK                        equ 0004h
TRISG_TRISG3_POSN                        equ 0003h
TRISG_TRISG3_POSITION                    equ 0003h
TRISG_TRISG3_SIZE                        equ 0001h
TRISG_TRISG3_LENGTH                      equ 0001h
TRISG_TRISG3_MASK                        equ 0008h
TRISG_TRISG4_POSN                        equ 0004h
TRISG_TRISG4_POSITION                    equ 0004h
TRISG_TRISG4_SIZE                        equ 0001h
TRISG_TRISG4_LENGTH                      equ 0001h
TRISG_TRISG4_MASK                        equ 0010h
TRISG_TRISG6_POSN                        equ 0006h
TRISG_TRISG6_POSITION                    equ 0006h
TRISG_TRISG6_SIZE                        equ 0001h
TRISG_TRISG6_LENGTH                      equ 0001h
TRISG_TRISG6_MASK                        equ 0040h
TRISG_TRISG7_POSN                        equ 0007h
TRISG_TRISG7_POSITION                    equ 0007h
TRISG_TRISG7_SIZE                        equ 0001h
TRISG_TRISG7_LENGTH                      equ 0001h
TRISG_TRISG7_MASK                        equ 0080h

// Register: TRISH
#define TRISH TRISH
TRISH                                    equ 0F99h
// bitfield definitions
TRISH_TRISH0_POSN                        equ 0000h
TRISH_TRISH0_POSITION                    equ 0000h
TRISH_TRISH0_SIZE                        equ 0001h
TRISH_TRISH0_LENGTH                      equ 0001h
TRISH_TRISH0_MASK                        equ 0001h
TRISH_TRISH1_POSN                        equ 0001h
TRISH_TRISH1_POSITION                    equ 0001h
TRISH_TRISH1_SIZE                        equ 0001h
TRISH_TRISH1_LENGTH                      equ 0001h
TRISH_TRISH1_MASK                        equ 0002h
TRISH_TRISH2_POSN                        equ 0002h
TRISH_TRISH2_POSITION                    equ 0002h
TRISH_TRISH2_SIZE                        equ 0001h
TRISH_TRISH2_LENGTH                      equ 0001h
TRISH_TRISH2_MASK                        equ 0004h
TRISH_TRISH3_POSN                        equ 0003h
TRISH_TRISH3_POSITION                    equ 0003h
TRISH_TRISH3_SIZE                        equ 0001h
TRISH_TRISH3_LENGTH                      equ 0001h
TRISH_TRISH3_MASK                        equ 0008h
TRISH_TRISH4_POSN                        equ 0004h
TRISH_TRISH4_POSITION                    equ 0004h
TRISH_TRISH4_SIZE                        equ 0001h
TRISH_TRISH4_LENGTH                      equ 0001h
TRISH_TRISH4_MASK                        equ 0010h
TRISH_TRISH5_POSN                        equ 0005h
TRISH_TRISH5_POSITION                    equ 0005h
TRISH_TRISH5_SIZE                        equ 0001h
TRISH_TRISH5_LENGTH                      equ 0001h
TRISH_TRISH5_MASK                        equ 0020h
TRISH_TRISH6_POSN                        equ 0006h
TRISH_TRISH6_POSITION                    equ 0006h
TRISH_TRISH6_SIZE                        equ 0001h
TRISH_TRISH6_LENGTH                      equ 0001h
TRISH_TRISH6_MASK                        equ 0040h
TRISH_TRISH7_POSN                        equ 0007h
TRISH_TRISH7_POSITION                    equ 0007h
TRISH_TRISH7_SIZE                        equ 0001h
TRISH_TRISH7_LENGTH                      equ 0001h
TRISH_TRISH7_MASK                        equ 0080h

// Register: TRISJ
#define TRISJ TRISJ
TRISJ                                    equ 0F9Ah
// bitfield definitions
TRISJ_TRISJ0_POSN                        equ 0000h
TRISJ_TRISJ0_POSITION                    equ 0000h
TRISJ_TRISJ0_SIZE                        equ 0001h
TRISJ_TRISJ0_LENGTH                      equ 0001h
TRISJ_TRISJ0_MASK                        equ 0001h
TRISJ_TRISJ1_POSN                        equ 0001h
TRISJ_TRISJ1_POSITION                    equ 0001h
TRISJ_TRISJ1_SIZE                        equ 0001h
TRISJ_TRISJ1_LENGTH                      equ 0001h
TRISJ_TRISJ1_MASK                        equ 0002h
TRISJ_TRISJ2_POSN                        equ 0002h
TRISJ_TRISJ2_POSITION                    equ 0002h
TRISJ_TRISJ2_SIZE                        equ 0001h
TRISJ_TRISJ2_LENGTH                      equ 0001h
TRISJ_TRISJ2_MASK                        equ 0004h
TRISJ_TRISJ3_POSN                        equ 0003h
TRISJ_TRISJ3_POSITION                    equ 0003h
TRISJ_TRISJ3_SIZE                        equ 0001h
TRISJ_TRISJ3_LENGTH                      equ 0001h
TRISJ_TRISJ3_MASK                        equ 0008h
TRISJ_TRISJ4_POSN                        equ 0004h
TRISJ_TRISJ4_POSITION                    equ 0004h
TRISJ_TRISJ4_SIZE                        equ 0001h
TRISJ_TRISJ4_LENGTH                      equ 0001h
TRISJ_TRISJ4_MASK                        equ 0010h
TRISJ_TRISJ5_POSN                        equ 0005h
TRISJ_TRISJ5_POSITION                    equ 0005h
TRISJ_TRISJ5_SIZE                        equ 0001h
TRISJ_TRISJ5_LENGTH                      equ 0001h
TRISJ_TRISJ5_MASK                        equ 0020h
TRISJ_TRISJ6_POSN                        equ 0006h
TRISJ_TRISJ6_POSITION                    equ 0006h
TRISJ_TRISJ6_SIZE                        equ 0001h
TRISJ_TRISJ6_LENGTH                      equ 0001h
TRISJ_TRISJ6_MASK                        equ 0040h
TRISJ_TRISJ7_POSN                        equ 0007h
TRISJ_TRISJ7_POSITION                    equ 0007h
TRISJ_TRISJ7_SIZE                        equ 0001h
TRISJ_TRISJ7_LENGTH                      equ 0001h
TRISJ_TRISJ7_MASK                        equ 0080h

