GopalSaraf/Practicals/PSDL/include/proc/pic18f97j94.inc
// Register: OSCTUNE
#define OSCTUNE OSCTUNE
OSCTUNE                                  equ 0F9Bh
// bitfield definitions
OSCTUNE_TUN_POSN                         equ 0000h
OSCTUNE_TUN_POSITION                     equ 0000h
OSCTUNE_TUN_SIZE                         equ 0006h
OSCTUNE_TUN_LENGTH                       equ 0006h
OSCTUNE_TUN_MASK                         equ 003Fh
OSCTUNE_TUN0_POSN                        equ 0000h
OSCTUNE_TUN0_POSITION                    equ 0000h
OSCTUNE_TUN0_SIZE                        equ 0001h
OSCTUNE_TUN0_LENGTH                      equ 0001h
OSCTUNE_TUN0_MASK                        equ 0001h
OSCTUNE_TUN1_POSN                        equ 0001h
OSCTUNE_TUN1_POSITION                    equ 0001h
OSCTUNE_TUN1_SIZE                        equ 0001h
OSCTUNE_TUN1_LENGTH                      equ 0001h
OSCTUNE_TUN1_MASK                        equ 0002h
OSCTUNE_TUN2_POSN                        equ 0002h
OSCTUNE_TUN2_POSITION                    equ 0002h
OSCTUNE_TUN2_SIZE                        equ 0001h
OSCTUNE_TUN2_LENGTH                      equ 0001h
OSCTUNE_TUN2_MASK                        equ 0004h
OSCTUNE_TUN3_POSN                        equ 0003h
OSCTUNE_TUN3_POSITION                    equ 0003h
OSCTUNE_TUN3_SIZE                        equ 0001h
OSCTUNE_TUN3_LENGTH                      equ 0001h
OSCTUNE_TUN3_MASK                        equ 0008h
OSCTUNE_TUN4_POSN                        equ 0004h
OSCTUNE_TUN4_POSITION                    equ 0004h
OSCTUNE_TUN4_SIZE                        equ 0001h
OSCTUNE_TUN4_LENGTH                      equ 0001h
OSCTUNE_TUN4_MASK                        equ 0010h
OSCTUNE_TUN5_POSN                        equ 0005h
OSCTUNE_TUN5_POSITION                    equ 0005h
OSCTUNE_TUN5_SIZE                        equ 0001h
OSCTUNE_TUN5_LENGTH                      equ 0001h
OSCTUNE_TUN5_MASK                        equ 0020h

// Register: PSTR1CON
#define PSTR1CON PSTR1CON
PSTR1CON                                 equ 0F9Ch
// bitfield definitions
PSTR1CON_STRA_POSN                       equ 0000h
PSTR1CON_STRA_POSITION                   equ 0000h
PSTR1CON_STRA_SIZE                       equ 0001h
PSTR1CON_STRA_LENGTH                     equ 0001h
PSTR1CON_STRA_MASK                       equ 0001h
PSTR1CON_STRB_POSN                       equ 0001h
PSTR1CON_STRB_POSITION                   equ 0001h
PSTR1CON_STRB_SIZE                       equ 0001h
PSTR1CON_STRB_LENGTH                     equ 0001h
PSTR1CON_STRB_MASK                       equ 0002h
PSTR1CON_STRC_POSN                       equ 0002h
PSTR1CON_STRC_POSITION                   equ 0002h
PSTR1CON_STRC_SIZE                       equ 0001h
PSTR1CON_STRC_LENGTH                     equ 0001h
PSTR1CON_STRC_MASK                       equ 0004h
PSTR1CON_STRD_POSN                       equ 0003h
PSTR1CON_STRD_POSITION                   equ 0003h
PSTR1CON_STRD_SIZE                       equ 0001h
PSTR1CON_STRD_LENGTH                     equ 0001h
PSTR1CON_STRD_MASK                       equ 0008h
PSTR1CON_STRSYNC_POSN                    equ 0004h
PSTR1CON_STRSYNC_POSITION                equ 0004h
PSTR1CON_STRSYNC_SIZE                    equ 0001h
PSTR1CON_STRSYNC_LENGTH                  equ 0001h
PSTR1CON_STRSYNC_MASK                    equ 0010h
PSTR1CON_CMPL_POSN                       equ 0006h
PSTR1CON_CMPL_POSITION                   equ 0006h
PSTR1CON_CMPL_SIZE                       equ 0002h
PSTR1CON_CMPL_LENGTH                     equ 0002h
PSTR1CON_CMPL_MASK                       equ 00C0h
PSTR1CON_CMPL0_POSN                      equ 0006h
PSTR1CON_CMPL0_POSITION                  equ 0006h
PSTR1CON_CMPL0_SIZE                      equ 0001h
PSTR1CON_CMPL0_LENGTH                    equ 0001h
PSTR1CON_CMPL0_MASK                      equ 0040h
PSTR1CON_CMPL1_POSN                      equ 0007h
PSTR1CON_CMPL1_POSITION                  equ 0007h
PSTR1CON_CMPL1_SIZE                      equ 0001h
PSTR1CON_CMPL1_LENGTH                    equ 0001h
PSTR1CON_CMPL1_MASK                      equ 0080h
PSTR1CON_STRA1_POSN                      equ 0000h
PSTR1CON_STRA1_POSITION                  equ 0000h
PSTR1CON_STRA1_SIZE                      equ 0001h
PSTR1CON_STRA1_LENGTH                    equ 0001h
PSTR1CON_STRA1_MASK                      equ 0001h
PSTR1CON_STRB1_POSN                      equ 0001h
PSTR1CON_STRB1_POSITION                  equ 0001h
PSTR1CON_STRB1_SIZE                      equ 0001h
PSTR1CON_STRB1_LENGTH                    equ 0001h
PSTR1CON_STRB1_MASK                      equ 0002h
PSTR1CON_STRC1_POSN                      equ 0002h
PSTR1CON_STRC1_POSITION                  equ 0002h
PSTR1CON_STRC1_SIZE                      equ 0001h
PSTR1CON_STRC1_LENGTH                    equ 0001h
PSTR1CON_STRC1_MASK                      equ 0004h
PSTR1CON_STRD1_POSN                      equ 0003h
PSTR1CON_STRD1_POSITION                  equ 0003h
PSTR1CON_STRD1_SIZE                      equ 0001h
PSTR1CON_STRD1_LENGTH                    equ 0001h
PSTR1CON_STRD1_MASK                      equ 0008h
PSTR1CON_STRSYNC1_POSN                   equ 0004h
PSTR1CON_STRSYNC1_POSITION               equ 0004h
PSTR1CON_STRSYNC1_SIZE                   equ 0001h
PSTR1CON_STRSYNC1_LENGTH                 equ 0001h
PSTR1CON_STRSYNC1_MASK                   equ 0010h
PSTR1CON_CMPL01_POSN                     equ 0006h
PSTR1CON_CMPL01_POSITION                 equ 0006h
PSTR1CON_CMPL01_SIZE                     equ 0001h
PSTR1CON_CMPL01_LENGTH                   equ 0001h
PSTR1CON_CMPL01_MASK                     equ 0040h
PSTR1CON_CMPL11_POSN                     equ 0007h
PSTR1CON_CMPL11_POSITION                 equ 0007h
PSTR1CON_CMPL11_SIZE                     equ 0001h
PSTR1CON_CMPL11_LENGTH                   equ 0001h
PSTR1CON_CMPL11_MASK                     equ 0080h
PSTR1CON_P1DC02_POSN                     equ 0000h
PSTR1CON_P1DC02_POSITION                 equ 0000h
PSTR1CON_P1DC02_SIZE                     equ 0001h
PSTR1CON_P1DC02_LENGTH                   equ 0001h
PSTR1CON_P1DC02_MASK                     equ 0001h
PSTR1CON_P1DC12_POSN                     equ 0001h
PSTR1CON_P1DC12_POSITION                 equ 0001h
PSTR1CON_P1DC12_SIZE                     equ 0001h
PSTR1CON_P1DC12_LENGTH                   equ 0001h
PSTR1CON_P1DC12_MASK                     equ 0002h
PSTR1CON_P1DC22_POSN                     equ 0002h
PSTR1CON_P1DC22_POSITION                 equ 0002h
PSTR1CON_P1DC22_SIZE                     equ 0001h
PSTR1CON_P1DC22_LENGTH                   equ 0001h
PSTR1CON_P1DC22_MASK                     equ 0004h
PSTR1CON_P1DC32_POSN                     equ 0003h
PSTR1CON_P1DC32_POSITION                 equ 0003h
PSTR1CON_P1DC32_SIZE                     equ 0001h
PSTR1CON_P1DC32_LENGTH                   equ 0001h
PSTR1CON_P1DC32_MASK                     equ 0008h
PSTR1CON_P1DC42_POSN                     equ 0004h
PSTR1CON_P1DC42_POSITION                 equ 0004h
PSTR1CON_P1DC42_SIZE                     equ 0001h
PSTR1CON_P1DC42_LENGTH                   equ 0001h
PSTR1CON_P1DC42_MASK                     equ 0010h
PSTR1CON_P1DC62_POSN                     equ 0006h
PSTR1CON_P1DC62_POSITION                 equ 0006h
PSTR1CON_P1DC62_SIZE                     equ 0001h
PSTR1CON_P1DC62_LENGTH                   equ 0001h
PSTR1CON_P1DC62_MASK                     equ 0040h
PSTR1CON_P1DC0CON_POSN                   equ 0000h
PSTR1CON_P1DC0CON_POSITION               equ 0000h
PSTR1CON_P1DC0CON_SIZE                   equ 0001h
PSTR1CON_P1DC0CON_LENGTH                 equ 0001h
PSTR1CON_P1DC0CON_MASK                   equ 0001h
PSTR1CON_P1DC1CON_POSN                   equ 0001h
PSTR1CON_P1DC1CON_POSITION               equ 0001h
PSTR1CON_P1DC1CON_SIZE                   equ 0001h
PSTR1CON_P1DC1CON_LENGTH                 equ 0001h
PSTR1CON_P1DC1CON_MASK                   equ 0002h
PSTR1CON_P1DC2CON_POSN                   equ 0002h
PSTR1CON_P1DC2CON_POSITION               equ 0002h
PSTR1CON_P1DC2CON_SIZE                   equ 0001h
PSTR1CON_P1DC2CON_LENGTH                 equ 0001h
PSTR1CON_P1DC2CON_MASK                   equ 0004h
PSTR1CON_P1DC3CON_POSN                   equ 0003h
PSTR1CON_P1DC3CON_POSITION               equ 0003h
PSTR1CON_P1DC3CON_SIZE                   equ 0001h
PSTR1CON_P1DC3CON_LENGTH                 equ 0001h
PSTR1CON_P1DC3CON_MASK                   equ 0008h
PSTR1CON_P1DC4CON_POSN                   equ 0004h
PSTR1CON_P1DC4CON_POSITION               equ 0004h
PSTR1CON_P1DC4CON_SIZE                   equ 0001h
PSTR1CON_P1DC4CON_LENGTH                 equ 0001h
PSTR1CON_P1DC4CON_MASK                   equ 0010h
PSTR1CON_P1DC6CON_POSN                   equ 0006h
PSTR1CON_P1DC6CON_POSITION               equ 0006h
PSTR1CON_P1DC6CON_SIZE                   equ 0001h
PSTR1CON_P1DC6CON_LENGTH                 equ 0001h
PSTR1CON_P1DC6CON_MASK                   equ 0040h

// Register: PIE1
#define PIE1 PIE1
PIE1                                     equ 0F9Dh
// bitfield definitions
PIE1_TMR1IE_POSN                         equ 0000h
PIE1_TMR1IE_POSITION                     equ 0000h
PIE1_TMR1IE_SIZE                         equ 0001h
PIE1_TMR1IE_LENGTH                       equ 0001h
PIE1_TMR1IE_MASK                         equ 0001h
PIE1_TMR2IE_POSN                         equ 0001h
PIE1_TMR2IE_POSITION                     equ 0001h
PIE1_TMR2IE_SIZE                         equ 0001h
PIE1_TMR2IE_LENGTH                       equ 0001h
PIE1_TMR2IE_MASK                         equ 0002h
PIE1_TMR1GIE_POSN                        equ 0002h
PIE1_TMR1GIE_POSITION                    equ 0002h
PIE1_TMR1GIE_SIZE                        equ 0001h
PIE1_TMR1GIE_LENGTH                      equ 0001h
PIE1_TMR1GIE_MASK                        equ 0004h
PIE1_SSP1IE_POSN                         equ 0003h
PIE1_SSP1IE_POSITION                     equ 0003h
PIE1_SSP1IE_SIZE                         equ 0001h
PIE1_SSP1IE_LENGTH                       equ 0001h
PIE1_SSP1IE_MASK                         equ 0008h
PIE1_TX1IE_POSN                          equ 0004h
PIE1_TX1IE_POSITION                      equ 0004h
PIE1_TX1IE_SIZE                          equ 0001h
PIE1_TX1IE_LENGTH                        equ 0001h
PIE1_TX1IE_MASK                          equ 0010h
PIE1_RC1IE_POSN                          equ 0005h
PIE1_RC1IE_POSITION                      equ 0005h
PIE1_RC1IE_SIZE                          equ 0001h
PIE1_RC1IE_LENGTH                        equ 0001h
PIE1_RC1IE_MASK                          equ 0020h
PIE1_ADIE_POSN                           equ 0006h
PIE1_ADIE_POSITION                       equ 0006h
PIE1_ADIE_SIZE                           equ 0001h
PIE1_ADIE_LENGTH                         equ 0001h
PIE1_ADIE_MASK                           equ 0040h
PIE1_PSPIE_POSN                          equ 0007h
PIE1_PSPIE_POSITION                      equ 0007h
PIE1_PSPIE_SIZE                          equ 0001h
PIE1_PSPIE_LENGTH                        equ 0001h
PIE1_PSPIE_MASK                          equ 0080h
PIE1_TXIE_POSN                           equ 0004h
PIE1_TXIE_POSITION                       equ 0004h
PIE1_TXIE_SIZE                           equ 0001h
PIE1_TXIE_LENGTH                         equ 0001h
PIE1_TXIE_MASK                           equ 0010h

// Register: PIR1
#define PIR1 PIR1
PIR1                                     equ 0F9Eh
// bitfield definitions
PIR1_TMR1IF_POSN                         equ 0000h
PIR1_TMR1IF_POSITION                     equ 0000h
PIR1_TMR1IF_SIZE                         equ 0001h
PIR1_TMR1IF_LENGTH                       equ 0001h
PIR1_TMR1IF_MASK                         equ 0001h
PIR1_TMR2IF_POSN                         equ 0001h
PIR1_TMR2IF_POSITION                     equ 0001h
PIR1_TMR2IF_SIZE                         equ 0001h
PIR1_TMR2IF_LENGTH                       equ 0001h
PIR1_TMR2IF_MASK                         equ 0002h
PIR1_TMR1GIF_POSN                        equ 0002h
PIR1_TMR1GIF_POSITION                    equ 0002h
PIR1_TMR1GIF_SIZE                        equ 0001h
PIR1_TMR1GIF_LENGTH                      equ 0001h
PIR1_TMR1GIF_MASK                        equ 0004h
PIR1_SSP1IF_POSN                         equ 0003h
PIR1_SSP1IF_POSITION                     equ 0003h
PIR1_SSP1IF_SIZE                         equ 0001h
PIR1_SSP1IF_LENGTH                       equ 0001h
PIR1_SSP1IF_MASK                         equ 0008h
PIR1_TX1IF_POSN                          equ 0004h
PIR1_TX1IF_POSITION                      equ 0004h
PIR1_TX1IF_SIZE                          equ 0001h
PIR1_TX1IF_LENGTH                        equ 0001h
PIR1_TX1IF_MASK                          equ 0010h
PIR1_RC1IF_POSN                          equ 0005h
PIR1_RC1IF_POSITION                      equ 0005h
PIR1_RC1IF_SIZE                          equ 0001h
PIR1_RC1IF_LENGTH                        equ 0001h
PIR1_RC1IF_MASK                          equ 0020h
PIR1_ADIF_POSN                           equ 0006h
PIR1_ADIF_POSITION                       equ 0006h
PIR1_ADIF_SIZE                           equ 0001h
PIR1_ADIF_LENGTH                         equ 0001h
PIR1_ADIF_MASK                           equ 0040h
PIR1_PSPIF_POSN                          equ 0007h
PIR1_PSPIF_POSITION                      equ 0007h
PIR1_PSPIF_SIZE                          equ 0001h
PIR1_PSPIF_LENGTH                        equ 0001h
PIR1_PSPIF_MASK                          equ 0080h
PIR1_TXIF_POSN                           equ 0004h
PIR1_TXIF_POSITION                       equ 0004h
PIR1_TXIF_SIZE                           equ 0001h
PIR1_TXIF_LENGTH                         equ 0001h
PIR1_TXIF_MASK                           equ 0010h

// Register: IPR1
#define IPR1 IPR1
IPR1                                     equ 0F9Fh
// bitfield definitions
IPR1_TMR1IP_POSN                         equ 0000h
IPR1_TMR1IP_POSITION                     equ 0000h
IPR1_TMR1IP_SIZE                         equ 0001h
IPR1_TMR1IP_LENGTH                       equ 0001h
IPR1_TMR1IP_MASK                         equ 0001h
IPR1_TMR2IP_POSN                         equ 0001h
IPR1_TMR2IP_POSITION                     equ 0001h
IPR1_TMR2IP_SIZE                         equ 0001h
IPR1_TMR2IP_LENGTH                       equ 0001h
IPR1_TMR2IP_MASK                         equ 0002h
IPR1_TMR1GIP_POSN                        equ 0002h
IPR1_TMR1GIP_POSITION                    equ 0002h
IPR1_TMR1GIP_SIZE                        equ 0001h
IPR1_TMR1GIP_LENGTH                      equ 0001h
IPR1_TMR1GIP_MASK                        equ 0004h
IPR1_SSP1IP_POSN                         equ 0003h
IPR1_SSP1IP_POSITION                     equ 0003h
IPR1_SSP1IP_SIZE                         equ 0001h
IPR1_SSP1IP_LENGTH                       equ 0001h
IPR1_SSP1IP_MASK                         equ 0008h
IPR1_TX1IP_POSN                          equ 0004h
IPR1_TX1IP_POSITION                      equ 0004h
IPR1_TX1IP_SIZE                          equ 0001h
IPR1_TX1IP_LENGTH                        equ 0001h
IPR1_TX1IP_MASK                          equ 0010h
IPR1_RC1IP_POSN                          equ 0005h
IPR1_RC1IP_POSITION                      equ 0005h
IPR1_RC1IP_SIZE                          equ 0001h
IPR1_RC1IP_LENGTH                        equ 0001h
IPR1_RC1IP_MASK                          equ 0020h
IPR1_ADIP_POSN                           equ 0006h
IPR1_ADIP_POSITION                       equ 0006h
IPR1_ADIP_SIZE                           equ 0001h
IPR1_ADIP_LENGTH                         equ 0001h
IPR1_ADIP_MASK                           equ 0040h
IPR1_PSPIP_POSN                          equ 0007h
IPR1_PSPIP_POSITION                      equ 0007h
IPR1_PSPIP_SIZE                          equ 0001h
IPR1_PSPIP_LENGTH                        equ 0001h
IPR1_PSPIP_MASK                          equ 0080h

// Register: PIE2
#define PIE2 PIE2
PIE2                                     equ 0FA0h
// bitfield definitions
PIE2_TMR3GIE_POSN                        equ 0000h
PIE2_TMR3GIE_POSITION                    equ 0000h
PIE2_TMR3GIE_SIZE                        equ 0001h
PIE2_TMR3GIE_LENGTH                      equ 0001h
PIE2_TMR3GIE_MASK                        equ 0001h
PIE2_TMR3IE_POSN                         equ 0001h
PIE2_TMR3IE_POSITION                     equ 0001h
PIE2_TMR3IE_SIZE                         equ 0001h
PIE2_TMR3IE_LENGTH                       equ 0001h
PIE2_TMR3IE_MASK                         equ 0002h
PIE2_HLVDIE_POSN                         equ 0002h
PIE2_HLVDIE_POSITION                     equ 0002h
PIE2_HLVDIE_SIZE                         equ 0001h
PIE2_HLVDIE_LENGTH                       equ 0001h
PIE2_HLVDIE_MASK                         equ 0004h
PIE2_BCL1IE_POSN                         equ 0003h
PIE2_BCL1IE_POSITION                     equ 0003h
PIE2_BCL1IE_SIZE                         equ 0001h
PIE2_BCL1IE_LENGTH                       equ 0001h
PIE2_BCL1IE_MASK                         equ 0008h
PIE2_USBIE_POSN                          equ 0004h
PIE2_USBIE_POSITION                      equ 0004h
PIE2_USBIE_SIZE                          equ 0001h
PIE2_USBIE_LENGTH                        equ 0001h
PIE2_USBIE_MASK                          equ 0010h
PIE2_BCL2IE_POSN                         equ 0005h
PIE2_BCL2IE_POSITION                     equ 0005h
PIE2_BCL2IE_SIZE                         equ 0001h
PIE2_BCL2IE_LENGTH                       equ 0001h
PIE2_BCL2IE_MASK                         equ 0020h
PIE2_SSP2IE_POSN                         equ 0006h
PIE2_SSP2IE_POSITION                     equ 0006h
PIE2_SSP2IE_SIZE                         equ 0001h
PIE2_SSP2IE_LENGTH                       equ 0001h
PIE2_SSP2IE_MASK                         equ 0040h
PIE2_OSCFIE_POSN                         equ 0007h
PIE2_OSCFIE_POSITION                     equ 0007h
PIE2_OSCFIE_SIZE                         equ 0001h
PIE2_OSCFIE_LENGTH                       equ 0001h
PIE2_OSCFIE_MASK                         equ 0080h
PIE2_CMIE_POSN                           equ 0006h
PIE2_CMIE_POSITION                       equ 0006h
PIE2_CMIE_SIZE                           equ 0001h
PIE2_CMIE_LENGTH                         equ 0001h
PIE2_CMIE_MASK                           equ 0040h

// Register: PIR2
#define PIR2 PIR2
PIR2                                     equ 0FA1h
// bitfield definitions
PIR2_TMR3GIF_POSN                        equ 0000h
PIR2_TMR3GIF_POSITION                    equ 0000h
PIR2_TMR3GIF_SIZE                        equ 0001h
PIR2_TMR3GIF_LENGTH                      equ 0001h
PIR2_TMR3GIF_MASK                        equ 0001h
PIR2_TMR3IF_POSN                         equ 0001h
PIR2_TMR3IF_POSITION                     equ 0001h
PIR2_TMR3IF_SIZE                         equ 0001h
PIR2_TMR3IF_LENGTH                       equ 0001h
PIR2_TMR3IF_MASK                         equ 0002h
PIR2_HLVDIF_POSN                         equ 0002h
PIR2_HLVDIF_POSITION                     equ 0002h
PIR2_HLVDIF_SIZE                         equ 0001h
PIR2_HLVDIF_LENGTH                       equ 0001h
PIR2_HLVDIF_MASK                         equ 0004h
PIR2_BCL1IF_POSN                         equ 0003h
PIR2_BCL1IF_POSITION                     equ 0003h
PIR2_BCL1IF_SIZE                         equ 0001h
PIR2_BCL1IF_LENGTH                       equ 0001h
PIR2_BCL1IF_MASK                         equ 0008h
PIR2_USBIF_POSN                          equ 0004h
PIR2_USBIF_POSITION                      equ 0004h
PIR2_USBIF_SIZE                          equ 0001h
PIR2_USBIF_LENGTH                        equ 0001h
PIR2_USBIF_MASK                          equ 0010h
PIR2_BCL2IF_POSN                         equ 0005h
PIR2_BCL2IF_POSITION                     equ 0005h
PIR2_BCL2IF_SIZE                         equ 0001h
PIR2_BCL2IF_LENGTH                       equ 0001h
PIR2_BCL2IF_MASK                         equ 0020h
PIR2_SSP2IF_POSN                         equ 0006h
PIR2_SSP2IF_POSITION                     equ 0006h
PIR2_SSP2IF_SIZE                         equ 0001h
PIR2_SSP2IF_LENGTH                       equ 0001h
PIR2_SSP2IF_MASK                         equ 0040h
PIR2_OSCFIF_POSN                         equ 0007h
PIR2_OSCFIF_POSITION                     equ 0007h
PIR2_OSCFIF_SIZE                         equ 0001h
PIR2_OSCFIF_LENGTH                       equ 0001h
PIR2_OSCFIF_MASK                         equ 0080h
PIR2_LVDIF_POSN                          equ 0002h
PIR2_LVDIF_POSITION                      equ 0002h
PIR2_LVDIF_SIZE                          equ 0001h
PIR2_LVDIF_LENGTH                        equ 0001h
PIR2_LVDIF_MASK                          equ 0004h
PIR2_CMIF_POSN                           equ 0006h
PIR2_CMIF_POSITION                       equ 0006h
PIR2_CMIF_SIZE                           equ 0001h
PIR2_CMIF_LENGTH                         equ 0001h
PIR2_CMIF_MASK                           equ 0040h

// Register: IPR2
#define IPR2 IPR2
IPR2                                     equ 0FA2h
// bitfield definitions
IPR2_TMR3GIP_POSN                        equ 0000h
IPR2_TMR3GIP_POSITION                    equ 0000h
IPR2_TMR3GIP_SIZE                        equ 0001h
IPR2_TMR3GIP_LENGTH                      equ 0001h
IPR2_TMR3GIP_MASK                        equ 0001h
IPR2_TMR3IP_POSN                         equ 0001h
IPR2_TMR3IP_POSITION                     equ 0001h
IPR2_TMR3IP_SIZE                         equ 0001h
IPR2_TMR3IP_LENGTH                       equ 0001h
IPR2_TMR3IP_MASK                         equ 0002h
IPR2_HLVDIP_POSN                         equ 0002h
IPR2_HLVDIP_POSITION                     equ 0002h
IPR2_HLVDIP_SIZE                         equ 0001h
IPR2_HLVDIP_LENGTH                       equ 0001h
IPR2_HLVDIP_MASK                         equ 0004h
IPR2_BCL1IP_POSN                         equ 0003h
IPR2_BCL1IP_POSITION                     equ 0003h
IPR2_BCL1IP_SIZE                         equ 0001h
IPR2_BCL1IP_LENGTH                       equ 0001h
IPR2_BCL1IP_MASK                         equ 0008h
IPR2_USBIP_POSN                          equ 0004h
IPR2_USBIP_POSITION                      equ 0004h
IPR2_USBIP_SIZE                          equ 0001h
IPR2_USBIP_LENGTH                        equ 0001h
IPR2_USBIP_MASK                          equ 0010h
IPR2_BCL2IP_POSN                         equ 0005h
IPR2_BCL2IP_POSITION                     equ 0005h
IPR2_BCL2IP_SIZE                         equ 0001h
IPR2_BCL2IP_LENGTH                       equ 0001h
IPR2_BCL2IP_MASK                         equ 0020h
IPR2_SSP2IP_POSN                         equ 0006h
IPR2_SSP2IP_POSITION                     equ 0006h
IPR2_SSP2IP_SIZE                         equ 0001h
IPR2_SSP2IP_LENGTH                       equ 0001h
IPR2_SSP2IP_MASK                         equ 0040h
IPR2_OSCFIP_POSN                         equ 0007h
IPR2_OSCFIP_POSITION                     equ 0007h
IPR2_OSCFIP_SIZE                         equ 0001h
IPR2_OSCFIP_LENGTH                       equ 0001h
IPR2_OSCFIP_MASK                         equ 0080h
IPR2_CMIP_POSN                           equ 0006h
IPR2_CMIP_POSITION                       equ 0006h
IPR2_CMIP_SIZE                           equ 0001h
IPR2_CMIP_LENGTH                         equ 0001h
IPR2_CMIP_MASK                           equ 0040h

